app/controllers/dashboards_controller.rb

  def index
    # return all the listings if the user has a profile already
    if current_user.has_profile?
      @user = User.find(current_user.id)
      if @user.is_employer?
        @applications = []
        @matches = Hash.new
        # find all the matched hunters for each listing for an employer_profile
        # and return a hash of hunters for each listing
        @user.employer_profile.listings.each do |listing|
          # get all of the matches for a listing
          matchedHunters = find_listing_matches(listing.id)
          # store an array of the hunters
          @matches.store(listing, matchedHunters)
          # get all of the applications
          employments = Employment.where(:listing_id => listing.id, :offer => false)
          if !employments.nil?
            employments.each do |e|
              @applications.append(HunterProfile.find(e.hunter_profile_id))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "listings".* FROM "listings" INNER JOIN "hunter_profiles_listings" ON "hunter_profiles_listings"."listing_id" = "listings"."id" INNER JOIN "hunter_profiles" ON "hunter_profiles"."id" = "hunter_profiles_listings"."hunter_profile_id"
SELECT  "hunter_profiles".* FROM "hunter_profiles" WHERE "hunter_profiles"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]