app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings"
---
  def index
    @listings = Listing.all

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @listings = Listing.find(params[:id])

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_listing
      @listing = Listing.find(params[:id])